app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
    @histories = History.all

INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hola"], ["picture", "eliminar-pis-de-gato.jpg"], ["content", "hola"], ["created_at", "2018-07-21 01:20:53.125957"], ["updated_at", "2018-07-21 01:20:53.125957"], ["user_id", 1]]
---
  def create
    @history = History.new(history_params)
    @history.user_id = current_user.id

    respond_to do |format|
      if @history.save

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])